Revit 2027 API
ICentralLockedCallback Methods
The ICentralLockedCallback type exposes the following members.
Methods
Name | Description
ShouldWaitForLockAvailability |  Returns whether Revit should wait and try again to acquire the lock on central.
Top
See Also
Reference
ICentralLockedCallback Interface
Autodesk.Revit.DB Namespace